//;******************************************************************************
//;* Copyright (c) 1983-2021, Insyde Software Corp. All Rights Reserved.
//;*
//;* You may not reproduce, distribute, publish, display, perform, modify, adapt,
//;* transmit, broadcast, present, recite, release, license or otherwise exploit
//;* any part of this publication in any form, by any means, without the prior
//;* written permission of Insyde Software Corporation.
//;*
//;******************************************************************************
//;
//; Module Name:
//;
//;   Strings.uni
//;
//; Abstract:
//;
//;   String definitions for BdsPlatform formset.
//;
//
//    String definitions for BdsPlatform formset.
//
//  Copyright (c) 2004 - 2010, Intel Corporation. All rights reserved.<BR>
//  This program and the accompanying materials
//  are licensed and made available under the terms and conditions of the BSD License
//  which accompanies this distribution.  The full text of the license may be found at
//  http://opensource.org/licenses/bsd-license.php
//
//  THE PROGRAM IS DISTRIBUTED UNDER THE BSD LICENSE ON AN "AS IS" BASIS,
//  WITHOUT WARRANTIES OR REPRESENTATIONS OF ANY KIND, EITHER EXPRESS OR IMPLIED.
//
//**/

/=#

#include "Standard.uni"

#string STR_INTERNAL_EFI_SHELL         #language en-US  "[Internal EFI Shell]"
                                       #language fr-FR  "[la Coquille interne de EFI]"
                                       #language zh-TW  "[\wide內部\narrowEFI Shell]"
                                       #language ja-JP  "[\wideインターナル\narrowEFI\wideシェール\narrow]"
                                       #language it-IT  "[Shell EFI Interna]"
                                       #language es-ES  "[Interna EFI Shell]"
                                       #language de-DE  "[Internal EFI-Hülle]"
                                       #language pt-PT  "[Interna EFI Shell]"
                                       
#string STR_LEGACY_BOOT_A              #language en-US  "[Internal Legacy Boot A:]"
                                       #language fr-FR  "[Amorce Legacy interne A:]"
                                       #language zh-TW  "[\wide內部傳統開機\narrowA:]"
                                       #language ja-JP  "[\wideインターナルレガシィブート\narrowA：]"
                                       #language it-IT  "[Legacy boot da A:]"
                                       #language es-ES  "[Interna Legacy Boot A:]"
                                       #language de-DE  "[Internal Erbschaft Aufputsch A:]"
                                       #language pt-PT  "[Interna Legacy Boot A:]"
                                       
#string STR_PROCESSED_ALL_BOOT_OPTIONS #language en-US  "[ProcessedAllBootOptions(): Load shell from the FV]"
                                       #language fr-FR  "[ProcessedAllBootOptions() : la coquille de Chargement du FV]"
                                       #language zh-TW  "[ProcessedAllBootOptions (): \wide由\narrowFV\wide載入\narrowShell]"
                                       #language ja-JP  "[\wideプロセスオルブートオプション\narrow()FV\wideからシェールをロードする\narrow]"
                                       #language it-IT  "[ProcessedAllBootOptions(): Carica shell dallo FV]"
                                       #language es-ES  "Procesado todas las opciones de arranques (): cargar capa desde FV"
                                       #language de-DE  "[Prozess. Alle Aufputschoptionen von FV-Aufl]"
                                       #language pt-PT  "[Todos os processados Opções de Inicialização (): carga shell a partir de FV]"
                                       
#string STR_DEFAULT_TIMEOUT_BANNER     #language en-US  "Default boot selection will be booted in "
                                       #language fr-FR  "Sélection de démarrage par défaut sera lancée"
                                       #language zh-TW  "\wide預設開機選擇項目將被載入\narrow"
                                       #language ja-JP  "\wideディフォルトブートオプションを起動する\narrow"
                                       #language it-IT  "Il sistema sia avvierà dal boot di default in"
                                       #language es-ES  "Selección de arranque predeterminado será arrancado en"
                                       #language de-DE  "Umlenkung Aufladungsauswahl wird erfolgen"
                                       #language pt-PT  "Seleção de boot de padrão será iniciado em"
                                       
#string STR_SECONDS                    #language en-US  " seconds"
                                       #language fr-FR  " les secondes"
                                       #language zh-TW  " \wide秒\narrow"
                                       #language ja-JP  " \wide秒\narrow"
                                       #language it-IT  " secondi"
                                       #language es-ES  " Segundo"
                                       #language de-DE  " Sekunden"
                                       #language pt-PT  " Segundos"
                                       
#string STR_EXIT_DATA                  #language en-US  "ExitData: "
                                       #language fr-FR  "ExitData: "
                                       #language zh-TW  "\wide離開資料\narrow:"
                                       #language ja-JP  "\wideデータ終了\narrow:"
                                       #language it-IT  "ExitData:"
                                       #language es-ES  "Salida de datos:"
                                       #language de-DE  "Ausgangsdaten:"
                                       #language pt-PT  "Saida de dados:"
                                       
#string STR_LOADING                    #language en-US  "Loading: "
                                       #language fr-FR  "Chargement: "
                                       #language zh-TW  "\wide載入中\narrow:"
                                       #language ja-JP  "\wideローディング\narrow:"
                                       #language it-IT  "Sto caricando:"
                                       #language es-ES  "Cargando:"
                                       #language de-DE  "Aufladung:"
                                       #language pt-PT  "Carregando:"
                                       
#string STR_ENTER_NORMAL_BOOT          #language en-US  "Entering Normal Boot Process..."
                                       #language fr-FR  "Saisie processus de démarrage normal..."
                                       #language zh-TW  "\wide正進入正常開機程序\narrow..."
                                       #language ja-JP  "\wide正常起動プロセスの実行中\narrow..."
                                       #language it-IT  "Avvio sequenza normale di Boot..."
                                       #language es-ES  "Entrando al proceso de arranque normal..."
                                       #language de-DE  "Betreten des Normalaufbauprozesses..."
                                       #language pt-PT  "Entrando ao processo de boot normal..."
#string STR_PERFORM_MEM_TEST           #language en-US  "Perform memory test"
                                       #language fr-FR  "Exécute l'examen de mémoire"
                                       #language zh-TW  "\wide進行記憶體測試\narrow"
                                       #language ja-JP  "\wideメモリテストを実行する\narrow"
                                       #language it-IT  "Avvio controllo memoria"
                                       #language es-ES  "Testeo del desempeño de la memoria"
                                       #language de-DE  "Vorführung des Speichertestes"
                                       #language pt-PT  "Faça o teste de memória"
#string STR_PROMPT_SKIP                #language en-US  " (%s to skip)"
                                       #language fr-FR  " (%s pour sauter)"
                                       #language zh-TW  " (\wide按\narrow%s\wide以略過\narrow)"
                                       #language ja-JP  " (\wideスキップにする場合、\narrow%s\wideを押してください\narrow)"
                                       #language it-IT  " (%s per interrompere)"
                                       #language es-ES  " (%s para saltar)"
                                       #language de-DE  " (%s überspr)"
                                       #language pt-PT  " (%s para saltar)"
#string STR_MEMORY_TEST_PERCENT        #language en-US  "% of the system memory tested OK"
                                       #language fr-FR  "% de la mémoire de système essayée D'ACCORD"
                                       #language zh-TW  "%\wide之系統記憶體已測試無誤\narrow"
                                       #language ja-JP  "\wideシステムメモリ\narrow%\wide検査をパスした\narrow"
                                       #language it-IT  "% della memoria di sistema controllata OK"
                                       #language es-ES  "% de la memoria del sistema testeado OK"
                                       #language de-DE  "% des Speichersystems i.O. getestet"
                                       #language pt-PT  "% Da memória do sistema testado OK"
                                       
#string STR_TO_SKIP_MEM_TEST           #language en-US  "Press %s key to skip memory test"
                                       #language fr-FR  "Appuie sur %s sauter examen de mémoire"
#string STR_MEM_TEST_COMPLETED         #language en-US  " bytes of system memory tested OK"
                                       #language fr-FR  " octets dela mémoire de système essayée D'ACCORD"
                                       #language zh-TW  " \wide系統記憶體位元組測試無誤\narrow"
                                       #language ja-JP  " \wideシステムメモリバイト検査をパスした\narrow"
                                       #language it-IT  " bytes della memoria di sistema testati OK"
                                       #language es-ES  " Bits del testeo de la memoria del sistema OK"
                                       #language de-DE  " Bytes des Systemspeichers getested und i.O"
                                       #language pt-PT  " Bytes de memória do sistema testado OK"
                                       
#string STR_NO_EXT_MEM_FOUND           #language en-US  "Memory resource updated!"
                                       #language fr-FR  "la mémoire Non étendue trouvée!"
                                       #language zh-TW  "\wide記憶體資源已更新\narrow!"
                                       #language ja-JP  "\wideメモリリソース更新\narrow"
                                       #language it-IT  "Risorsa Memoria aggiornata!"
                                       #language es-ES  "Actualización del recurso de la memoria!"
                                       #language de-DE  "Speicherquelle aufdatiert"
                                       #language pt-PT  "Recurso de memória atualizada!"
                                       
#string STR_SYSTEM_MEM_ERROR           #language en-US  "System encounters memory errors"
                                       #language fr-FR  "le Système rencontre les erreurs de mémoire"
                                       #language zh-TW  "\wide系統發生記憶體錯誤\narrow"
                                       #language ja-JP  "\wideシステムにはメモリエラー発生する\narrow"
                                       #language it-IT  "Il Sistema ha incontrato errori di memoria"
                                       #language es-ES  "Sistema encontró error de memoria"
                                       #language de-DE  "System empfängt Speicherfehler"
                                       #language pt-PT  "O sistema encontra erros de memória"
                                       
//#string STR_START_BOOT_OPTION        #language en-US  "Start boot option"
//                                     #language fr-FR  "l'option de botte de Début"

#string STR_AUTO_FAILOVER_DISABLE_BOOT_FAIL         #language en-US  "Default Boot Device Missing or Boot Failed.\nInsert Recovery Media and Hit any key.\nThen Select 'Boot Manager' to choose a new Boot Device or to Boot Recovery Media"
#string STR_AUTO_FAILOVER_NO_BOOT_DEVICE            #language en-US  "Default Boot Device Missing or Boot Failed.\nInsert Recovery Media and Hit any key \nThen Select 'Boot Manager' to choose a new Boot Device or to Boot Recovery Media"
#string STR_AUTO_FAILOVER_NO_ACTIVE_BOOT_OPTION     #language en-US  "No Any Active Boot Option.\nInsert Recovery Media and Hit any key \nThen Select 'Boot Manager' to choose a new Boot Device or to Boot Recovery Media"
#string STR_USB_OPTION_INEXISTENCE     #language en-US        "System doesn't have any USB boot option. Please select other boot option in Boot Manager Menu."
                                       #language fr-FR        "System doesn't have any USB boot option. Please select other boot option in Boot Manager Menu."
                                       #language zh-TW        "System doesn't have any USB boot option. Please select other boot option in Boot Manager Menu."
                                       #language ja-JP        "System doesn't have any USB boot option. Please select other boot option in Boot Manager Menu."
                                       #language it-IT        "System doesn't have any USB boot option. Please select other boot option in Boot Manager Menu."
                                       #language es-ES        "System doesn't have any USB boot option. Please select other boot option in Boot Manager Menu."
                                       #language de-DE        "System doesn't have any USB boot option. Please select other boot option in Boot Manager Menu."
                                       #language pt-PT        "System doesn't have any USB boot option. Please select other boot option in Boot Manager Menu."
#string STR_CD_OPTION_INEXISTENCE      #language en-US        "System doesn't have any CD/DVD boot option. Please select other boot option in Boot Manager Menu."
                                       #language fr-FR        "System doesn't have any CD/DVD boot option. Please select other boot option in Boot Manager Menu."
                                       #language zh-TW        "System doesn't have any CD/DVD boot option. Please select other boot option in Boot Manager Menu."
                                       #language ja-JP        "System doesn't have any CD/DVD boot option. Please select other boot option in Boot Manager Menu."
                                       #language it-IT        "System doesn't have any CD/DVD boot option. Please select other boot option in Boot Manager Menu."
                                       #language es-ES        "System doesn't have any CD/DVD boot option. Please select other boot option in Boot Manager Menu."
                                       #language de-DE        "System doesn't have any CD/DVD boot option. Please select other boot option in Boot Manager Menu."
                                       #language pt-PT        "System doesn't have any CD/DVD boot option. Please select other boot option in Boot Manager Menu."
#string STR_NETWORK_OPTION_INEXISTENCE #language en-US        "System doesn't have any Network boot option. Please select other boot option in Boot Manager Menu or Enable PXE Boot Option in SCU."
                                       #language fr-FR        "System doesn't have any Network boot option. Please select other boot option in Boot Manager Menu or Enable PXE Boot Option in SCU."
                                       #language zh-TW        "System doesn't have any Network boot option. Please select other boot option in Boot Manager Menu or Enable PXE Boot Option in SCU."
                                       #language ja-JP        "System doesn't have any Network boot option. Please select other boot option in Boot Manager Menu or Enable PXE Boot Option in SCU."
                                       #language it-IT        "System doesn't have any Network boot option. Please select other boot option in Boot Manager Menu or Enable PXE Boot Option in SCU."
                                       #language es-ES        "System doesn't have any Network boot option. Please select other boot option in Boot Manager Menu or Enable PXE Boot Option in SCU."
                                       #language de-DE        "System doesn't have any Network boot option. Please select other boot option in Boot Manager Menu or Enable PXE Boot Option in SCU."
                                       #language pt-PT        "System doesn't have any Network boot option. Please select other boot option in Boot Manager Menu or Enable PXE Boot Option in SCU."
#string STR_SELECT_USB_OPTION          #language en-US        "Which USB boot option do you want to select?"
                                       #language fr-FR        "Which USB boot option do you want to select?"
                                       #language zh-TW        "Which USB boot option do you want to select?"
                                       #language ja-JP        "Which USB boot option do you want to select?"
                                       #language it-IT        "Which USB boot option do you want to select?"
                                       #language es-ES        "Which USB boot option do you want to select?"
                                       #language de-DE        "Which USB boot option do you want to select?"
                                       #language pt-PT        "Which USB boot option do you want to select?"
#string STR_SELECT_CD_OPTION           #language en-US        "Which CD/DVD boot option do you want to select?"
                                       #language fr-FR        "Which CD/DVD boot option do you want to select?"
                                       #language zh-TW        "Which CD/DVD boot option do you want to select?"
                                       #language ja-JP        "Which CD/DVD boot option do you want to select?"
                                       #language it-IT        "Which CD/DVD boot option do you want to select?"
                                       #language es-ES        "Which CD/DVD boot option do you want to select?"
                                       #language de-DE        "Which CD/DVD boot option do you want to select?"
                                       #language pt-PT        "Which CD/DVD boot option do you want to select?"
#string STR_SELECT_NETWORK_OPTION      #language en-US        "Which network boot option do you want to select?"
                                       #language fr-FR        "Which network boot option do you want to select?"
                                       #language zh-TW        "Which network boot option do you want to select?"
                                       #language ja-JP        "Which network boot option do you want to select?"
                                       #language it-IT        "Which network boot option do you want to select?"
                                       #language es-ES        "Which network boot option do you want to select?"
                                       #language de-DE        "Which network boot option do you want to select?"
                                       #language pt-PT        "Which network boot option do you want to select?"
#string STR_TIMEOUT_CHANGE             #language en-US        "The timeout value is %d seconds and it is larger than maximum timeout value %d. Restore timeout variable to %d!!!"
                                       #language fr-FR        "The timeout value is %d seconds and it is larger than maximum timeout value %d. Restore timeout variable to %d!!!"
                                       #language zh-TW        "The timeout value is %d seconds and it is larger than maximum timeout value %d. Restore timeout variable to %d!!!"
                                       #language ja-JP        "The timeout value is %d seconds and it is larger than maximum timeout value %d. Restore timeout variable to %d!!!"
                                       #language it-IT        "The timeout value is %d seconds and it is larger than maximum timeout value %d. Restore timeout variable to %d!!!"
                                       #language es-ES        "The timeout value is %d seconds and it is larger than maximum timeout value %d. Restore timeout variable to %d!!!"
                                       #language de-DE        "The timeout value is %d seconds and it is larger than maximum timeout value %d. Restore timeout variable to %d!!!"
                                       #language pt-PT        "The timeout value is %d seconds and it is larger than maximum timeout value %d. Restore timeout variable to %d!!!"
//
// Update "Boot device error string (BDES)" for UEFI and CSM16.
//
#string STR_BOOT_DEVICE_ERROR_MESSAGE  #language en-US  ""
                                       #language fr-FR  ""
#string STR_EMPTY_STRING               #language en-US  ""